[
    {
        "title": "Harmful Algal Blooms Forecasting",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed as part of IEEE-Eta Kappa-Nu's projects program. "
    },
    {
        "title": "Dance Battle AI",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for the Data Science Student Society Hackathon (DataHacks). This project is a real-time multiplayer, full-stack web app where two players dance along to the same reference choreography and the one who matches it best wins!"
    },
    {
        "title": "Pariatur eos veniam ipsum!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Odit aperiam dolore placeat eum deserunt maxime modi nesciunt vitae amet reprehenderit? Tenetur quod repellat non necessitatibus odio harum cumque, minus earum voluptatem magnam tempora alias ipsam quasi, corporis facere?"
    },
    {
        "title": "Eos reprehenderit harum velit?",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quaerat nihil inventore consequatur dignissimos officia voluptas quisquam, rem numquam nesciunt odit sequi exercitationem, nemo ea repellendus hic possimus saepe, eveniet quod labore illo ab expedita minus. Eveniet, necessitatibus veritatis."
    },
    {
        "title": "Repellendus atque eum fugit!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptatum, cupiditate distinctio? Porro eius inventore sed nostrum ut vitae itaque quis blanditiis ullam, corporis veniam, sint nihil. A magni excepturi ab iusto dolorem modi corrupti ex, reiciendis dolores nihil."
    },
    {
        "title": "Obcaecati placeat nulla modi!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Omnis deserunt sed iusto ad nisi sit eum obcaecati rerum accusamus laboriosam. Natus libero quos facilis sed laudantium, eveniet beatae voluptas enim, provident cupiditate cum expedita maxime quis dolorem exercitationem?"
    },
    {
        "title": "Iure ad necessitatibus natus!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quasi corrupti illo totam aut nihil nostrum quae inventore mollitia, soluta molestias distinctio vero ea at tenetur dolorem eveniet ratione, pariatur voluptatem fugit fugiat quidem quo eum magnam? Ipsam, ipsa."
    },
    {
        "title": "Ut tenetur sunt repudiandae.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Quis sint eum sit aut officia vel praesentium doloribus ab numquam soluta distinctio ut ratione, esse totam expedita voluptatum adipisci! Nemo nostrum ut fugiat. Omnis aut perferendis fugit esse? Accusamus."
    },
    {
        "title": "Similique consequuntur cupiditate facere.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Pariatur harum neque excepturi, vitae nesciunt ipsum earum! Est ipsa quaerat rem vitae inventore natus iusto consectetur atque itaque deserunt, praesentium sed suscipit reiciendis doloremque. Qui, debitis modi! Autem, numquam."
    },
    {
        "title": "Est reprehenderit quas explicabo!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Explicabo, optio maxime est tempora provident nam dolorem, temporibus voluptas eaque nobis fugit soluta deleniti culpa totam quisquam nemo vero repellat hic dolorum fugiat suscipit commodi ipsa? Delectus, asperiores officiis."
    },
    {
        "title": "Autem assumenda ut corporis.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Molestias est dolorem nesciunt qui ducimus dignissimos nobis perferendis. Recusandae, soluta rerum debitis magnam vitae amet doloremque neque consequatur unde consectetur maiores alias repellat odio repudiandae officia, nulla esse provident."
    },
    {
        "title": "Sed deleniti repudiandae maxime.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Exercitationem veniam tempora fugit. Nesciunt obcaecati velit recusandae ipsum aperiam veniam praesentium cumque ut laudantium iste cum aliquam rerum alias, quo ipsam error exercitationem dolorem a consectetur tempore? Incidunt, voluptates!"
    }
]