[
    {
        "title": "Bikewatching",
        "year": "2025",
        "image": "/images/bikewatching.png",
        "url": "https://echungg1.github.io/bikewatching/",
        "description": "This project visualizes Boston’s Bluebikes traffic using an interactive Mapbox map and D3.js. Each station is represented by a circle whose size reflects total traffic volume and whose color shows the balance between departures and arrivals throughout the day."
    },
    {
        "title": "Harmful Algal Blooms Forecasting",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed as part of IEEE-Eta Kappa-Nu's projects program. This project aims to forecast harmful algal blooms using a zeroshot foundational model based on the T5 architecture."
    },
    {
        "title": "The Price of Health",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC106. This project effectively visualizes the difference in food processing levels and price between grocery stores."
    },
    {
        "title": "Dance Battle AI",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for the Data Science Student Society Hackathon (DataHacks). This project is a real-time multiplayer, full-stack web app where two players dance along to the same reference choreography and the one who matches it best wins!"
    },
    {
        "title": "Portfolio",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC106. This project is a personal web site that was made utilizing JS, HTML, and CSS."
    },
    {
        "title": "Sea-Level Anomaly Detection",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for the National Science Foundation Harnessing the Data Revolution Machine Learning Challenge Hackathon. This project uses a Convolutional Neural Network (CNN) to detect sea-level anomaly events from satellite heat maps across 12 coastal cities."
    },
    {
        "title": "Cooking Up Insights - Analyzing Recipe Ratings and Preparation Times",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC80. This project uses a Scikit-learn pipeline for linear regression, enhancing predictive modeling of cooking times based on recipe features like description length and seasonal trends."
    },
    {
        "title": "Image Processing App: Implementing Classes, Inheritance, and a KNN Classifier",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC30. This project is a Python-based image processing application focusing on object-oriented programming principles and includes a function for various image transformations and a KNN classifer to predict image labels."
    },
    {
        "title": "Meteorite Hypothesis Testing",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC10. This project visualizes meteorite data and performs hypothesis testing."
    },
    {
        "title": "Data Analysis of Taylor Swift's Discography",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Completed for DSC10. This Python-based data analysis project focuses on exploring lyrical and audio features of Taylor Swift's songs performing exploratory data analysis to uncover trends. "
    },
    {
        "title": "Movie Recommender",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This project builds a personalized movie recommender system using collaborative filtering to suggest films based on user preferences and viewing history."
    },
    {
        "title": "Spam Email Classifier",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This project trains a Naive Bayes model to classify spam emails based on message content and metadata."
    },
    {
        "title": "House Price Predictor",
        "year": "2020",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "This project predicts house prices using multiple regression on real estate features like size, location, and condition."
    }
]